---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.EnergyAnalysisFailures.RoomGeometryCannotTrimBoundingElement
source: html/b593fe63-e478-3310-3a94-429645806c77.htm
---
# Autodesk.Revit.DB.BuiltInFailures.EnergyAnalysisFailures.RoomGeometryCannotTrimBoundingElement Property

An error occurred while trimming the vertical shadow of a room-bounding element [Name] of the bounding geometry for [Room].

## Syntax (C#)
```csharp
public static FailureDefinitionId RoomGeometryCannotTrimBoundingElement { get; }
```